app/views/events/_form.html.erb

SELECT "places".* FROM "places"
---
    <%= form.label :Place %>
    <%= form.collection_select :place_id, Place.all,:id,:name, include_blank: true %>