app/views/tickets/_form.html.erb

    <%= form.label :Place %>
    <%= form.collection_select :event_id, Event.all,:id,:name, include_blank: true %>
---
SELECT "events".* FROM "events"