app/controllers/events_controller.rb

INSERT INTO "events" ("name", "description", "start_date", "place_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "aqui"], ["description", "sigo aqui"], ["start_date", "2019-05-24"], ["place_id", 8], ["created_at", "2019-05-23 05:42:36.984592"], ["updated_at", "2019-05-23 05:42:36.984592"]]
---
  def create

    @event = Event.new(name: params[:event][:name], description: params[:event][:description],
                       start_date: DateTime.parse(params[:event][:start_date]),place_id: params[:event][:place_id])

    respond_to do |format|
      if @event.save