app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("description", "price", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "vip"], ["price", 678000000], ["event_id", 11], ["created_at", "2019-05-23 14:57:54.245343"], ["updated_at", "2019-05-23 14:57:54.245343"]]
---
  def create
    puts params
    @ticket = Ticket.new(description: params[:ticket][:description], price: params[:ticket][:price],
                         event_id: params[:ticket][:event_id] )

    respond_to do |format|
      if @ticket.save