app/controllers/user_tickets_controller.rb

  def index
    @user_tickets = UserTicket.where( user_id: session["warden.user.user.key"][0][0])
    @user_tickets.each do |ticket|
---
SELECT "user_tickets".* FROM "user_tickets" WHERE "user_tickets"."user_id" = ?  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ?  [["id", 2]]

  def new
    @user_ticket = UserTicket.new
    events = Event.all
---
SELECT "events".* FROM "events"

  def destroy
    @user_ticket.destroy
---
DELETE FROM "user_tickets" WHERE "user_tickets"."id" = ?  [["id", 1]]

    def set_user_ticket
      @user_ticket = UserTicket.find(params[:id])
---
SELECT  "user_tickets".* FROM "user_tickets" WHERE "user_tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]